Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/atypical_work_scheme.html.txt.tmx
Source language: en
Languages: ga

source: The Atypical Working Scheme allows non-EEA nationals to do certain short-term contract work which is not covered by the Employment Permits Acts
ga: Ceadaíonn an Scéim Oibre Neamhthipiciúla náisiúnaigh neamh-LEE obair ghearrthéarmach chonartha áirithe a dhéanamh nach bhfuil cumhdaithe ag na hAchtanna um Cheadanna Fostaíochta

source: Under the Scheme, non-EEA nationals, such as locum doctors or those on short-term contracts for a company, are permitted to work in Ireland
ga: Faoin Scéim, ceadaítear náisiúnaigh neamh-LEE, ar nós dochtúirí ioncaim nó iad siúd atá ar chonarthaí ghearrthéarmacha le haghaidh cuideachta, chun oibriú in Éirinn

source: Non-EEA fishermen: Since 15 February 2016, certain non-EEA crew members working in the Irish fishing fleet may apply for the Atypical Working Scheme
ga: Iascairí Neamh-LEE: Ón 15 Feabhra 2016 ar aghaidh, féadfaidh baill chriú áirithe neamh-LEE atá ag oibriú i gcabhlach iascaigh na hÉireann iarratas a dhéanamh ar an Scéim Oibre Neamhthipiciúla

source: Applications for the Atypical Working Scheme must be made from outside Ireland
ga: Caithfear iarratais ar an Scéim Oibre Neamhthipiciúla a dhéanamh ó áiteanna lasmuigh d’Éirinn

source: Family members are not allowed to accompany a person who has been approved for the Atypical Working Scheme
ga: Ní cheadaítear do dhaoine muinteartha duine a thionlacan a faomhadh don Scéim Oibre Neamhthipiciúla

source: A non-EEA national may qualify for the Scheme if they are required by an Irish-based company to work in the following circumstances:
ga: Féadfaidh náisiúnach neamh-LEE cáiliú don Scéim má theastaíonn ó chuideachta atá bunaithe in Éirinn go n-oibríonn siad faoi na cúinsí a leanas:

source: • Where a skills shortage has been identified
ga: • Sa chás gur sainaithníodh ganntanas scileanna

source: • To provide a specialised or high skill to an industry, business or academic institution
ga: • Chun scil speisialaithe nó ardscil a sholáthar do thionscal, gnólacht nó institiúid acadúil

source: • As a paid or funded short-term employee or intern. This applies to students studying on an approved third-level course outside Ireland where the Irish employment or internship is part of the course
ga: • Mar fhostaí nó intéirneach gearrthéarmach a íoctar nó a chistítear Baineann seo le mic léinn a bhfuil staidéar á dhéanamh acu ar chúrsa faofa tríú leibhéal lasmuigh d’Éirinn sa chás go bhfuil an fhostaíocht nó an intéirneacht in Éirinn mar chuid den chúrsa

source: • As a locum doctor employed and paid by an agency (in the hospital or primary care sectors)
ga: • Mar dhochtúir ionaid atá fostaithe agus íoctha ag gníomhaireacht (sna hearnálacha ospidéil nó cúraim phríomhúil)

source: • As a nurse or midwife on the RCSI Clinical Adaptation and Assessment Programme
ga: • Mar altra nó bean chabhrach ar Chlár Measúnaithe agus Oiriúnaithe Chliniciúil an RCSI

source: You can read the criteria for the eligible categories described above
ga: Is féidir leat na critéir le haghaidh na gcatagóirí incháilithe a ndéantar cur síos orthu thuas a léamh

source: Who is not eligible
ga: Cé nach bhfuil incháilithe?

source: The Atypical Working Scheme does not apply to non-EEA nationals who:
ga: Ní bhaineann an Scéim Oibre Neamhthipiciúla le náisiúnaigh neamh-LEE:

source: • Are already living legally in Ireland
ga: • A bhfuil cónaí orthu in Éirinn cheana féin in aghaidh an dlí

source: • Are entering Ireland for employment purposes for up to 2 weeks
ga: • A bhfuil Éire á hiontráil acu ar mhaithe le cuspóirí fostaíochta ar feadh a fhad le 2 sheachtain

source: • Are entering Ireland for business purposes for up to 90 days, for example, to attend a conference or seminar
ga: • A bhfuil Éire á hiontráil acu ar mhaithe le cuspóirí gnó ar feadh a fhad le 90 lá, mar shampla, chun freastal ar chomhdháil nó ar sheimineár

source: • Already hold an employment permit
ga: • A bhfuil cead fostaíochta acu cheana féin

source: • Qualify for permission under the Van Der Elst Judgment
ga: • A cháilíonn do chead faoi Bhreithiúnas Van Der Elst

source: • Have a Highly Skilled Job Interview Authorisation
ga: • A bhfuil Údarú d’Agallamh Poist Ardoilte acu

source: • Have an Intra Company Transfer Employment Permit in another jurisdiction
ga: • A bhfuil Cead Fostaíochta um Aistriú Idirchuideachta acu i ndlínse eile

source: • Would be working in a company where their employment would result in more than 50% of the employees being non-EEA nationals
ga: • A bheadh ag oibriú i gcuideachta ina mbeadh breis agus 50% de na fostaithe ina náisiúnaigh neamh-LEE mar gheall ar a bhfostaíocht

source: The application fee is €250 which is non-refundable
ga: Is í an táille iarratais €250 agus ní aisíoctar í

source: Since 1 January 2017, payment must be made by Electronic Funds Transfer (EFT)
ga: Ó 1 Eanáir 2017, ní mór duit íocaíocht trí Ríomhaistriú Airgid a dhéanamh

source: You can find more information in the guidelines available on inis.gov.ie
ga: Tá tuilleadh faisnéise sna treoirlínte ar fáil ar inis.gov.ie

source: You must apply for the Scheme from outside Ireland and you must not travel to Ireland until you have an Atypical Working Scheme Letter of Approval
ga: Caithfidh tú iarratas a dhéanamh ar an Scéim ó áit lasmuigh d’Éirinn agus ní féidir leat taisteal go hÉirinn go dtí go bhfuil Litir Faofa de chuid na Scéime Oibre Neamhthipiciúla faighte agat

source: If an authorised representative is applying on your behalf, the application must include a letter of authorisation signed by you
ga: Má tá iarratas á dhéanamh ag ionadaí údaraithe thar do cheann, caithfear litir údaraithe atá sínithe agat gabháil leis an iarratas

source: You apply to the Irish Naturalisation and Immigration Service (INIS) using the application form (pdf) available on inis.gov.ie
ga: Féadfaidh tú iarratas a dhéanamh ar Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ) agus leas á bhaint as an bhfoirm iarratais (pdf) atá ar fáil ar inis.gov.ie

source: The list of supporting documentation to be enclosed with your application form is listed at the end of the form
ga: Liostaítear an liosta de cháipéisíocht tacaíochta atá le cur faoi iamh le d’fhoirm iarratais ag bun na foirme

source: A letter of confirmation from the Irish-based host organisation must be included with your application
ga: Caithfear litir dheimhnithe ón eagraíochta óstála atá bunaithe in Éirinn a chur san áireamh le d’iarratas

source: Applications should be sent by registered post to the Atypical Working Scheme Division of INIS – see ‘Where to apply’ below
ga: Ba cheart iarratais a sheoladh sa phost cláraithe chuig Rannóg na Scéime Oibre Neamhthipiciúla de SEIÉ – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: The processing time is at least 2 weeks (10 working days)
ga: Glacann an t-am próiseála ar a laghad 2 sheachtain (10 lá oibre)

source: Payment may be made by Electronic Funds Transfer (EFT)
ga: Má fhaomhtar d’iarratas, eiseoidh SEIÉ Litir Faofa duit

source: Since 1 January 2017, payment for the atypical working scheme must be made by Electronic Funds Transfer (EFT)
ga: Ó 1 Eanáir 2017, ní mór duit íocaíocht don scéim oibre neamhthipiciúla trí Ríomhaistriú Airgid a dhéanamh

source: The Atypical Working Scheme conditions and guidelines are available on inis.gov.ie
ga: Tá fáil ar choinníollacha agus treorlínte na Scéime Oibre Neamhthipiciúla ar inis.gov.ie

source: If you are a visa-required national, you must apply for an entry visa online
ga: Más náisiúnach óna dteastaíonn víosa thú, ní mór duit iarratas a dhéanamh ar víosa iontrála ar líne

source: A copy of your Letter of Approval must be enclosed as part of the documentation for your visa application
ga: Caithfear cóip de do Litir Faofa a chur faoi iamh mar chuid den cháipéisíocht do d’iarratas ar víosa

source: You cannot apply for a visa before you get the Letter of Approval
ga: Ní féidir leat iarratas a dhéanamh ar víosa sula bhfaigheann tú an Litir Faofa

source: You should allow 8 weeks for your visa application to be processed
ga: Ba cheart duit 8 seachtaine a thabhairt go bpróiseálfar d’iarratas ar víosa

source: Registration and permission to remain
ga: Clárúchán agus cead chun fanacht

source: If you will be staying in Ireland for longer than 90 days, you must register with your local immigration officer in the area where you live
ga: Má bheidh tú ag fanacht in Éirinn ar feadh breis agus 90 lá, caithfidh tú clárú le d’oifigeach inimirce áitiúil sa cheantar ina gcónaíonn tú

source: In the Dublin area, the registration is done at the Burgh Quay Registration Office. Since 15 September 2016, you must book an appointment online to visit it
ga: I gceantar Bhaile Átha Cliath, déantar an clárúchán ag Biúró Náisiúnta an Gharda Síochána um Inimirce (an GNIB)

source: If you are living outside Dublin, you should register at your regional registration office your local Garda District Headquarters
ga: Má tá cónaí ort lasmuigh de Bhaile Átha Cliath, ba cheart duit clárú ag Ceanncheathrú áitiúil Cheantar an Gharda Síochána
